def ex1():
    cmd = ('str', 2, 5.7, -10e5)

    match cmd:
        case tuple() as t:
            print(f'Кортеж: {t}')
        case _:
            print('Другой тип данных')

    print('Процесс закончен')


def ex2():
    books = [
        ("Преступление и наказание", "Федор Достоевский", 671),
        ("Гордость и предубеждение", "Джейн Остин", 432),
        ("1984", "Джордж Оруэлл", 328),
        ("Убить пересмешника", "Харпер Ли", 281),
        ("Гарри Поттер и философский камень", "Дж. К. Роулинг", 223),
        ("Властелин колец", "Дж. Р. Р. Толкин", 1178),
        ("Великий Гэтсби", "Ф. Скотт Фицджеральд", 180),
        ("Моби Дик", "Герман Мелвилл", 625),
        ("Одиссея", "Гомер", 384),
        ("Илиада", "Гомер", 683)
    ]

    match books[0]:
        case (str() as title, author, int() as pages, *_) if len(books[0]) >= 3:
            # скобки не создают tuple или list - это группирующие скобки
            # работает и для tuple и для list
            # *_ позволяет распоковать все элементы кортежа, вне зависимости от их кол-ва
            # но не будет работать, если указано всего 3 эл-а
            print(f'Книга: {title}; Автор: {author}; Количество страниц: {pages}')
        # case title, author, pages, price:
        #     # тут кол-во элементов больше, чем в кортеже
        #     print(f'Книга: {title}; Автор: {author}; Количество страниц: {pages}; Цена: {price}')
        # case title, author, pages:
        #     print(f'Книга: {title}; Автор: {author}; Количество страниц: {pages}')
        case _:
            print('Другой тип данных')

    print('Процесс закончен')


def ex3():
    book = (1, "1984", "Джордж Оруэлл", 328, 2024)
    # book = ["1984", "Джордж Оруэлл", 328, 2024]

    match book:
        case [_, str() as title, str() as author, int() as pages, _]:
            print(f'Книга: {title}; Автор: {author}; Количество страниц: {pages}')
        case (str() as title, str() as author, pages, _):
            print(f'Книга: {title}; Автор: {author}; Количество страниц: {pages}')
        case _:
            print('Другой формат данных')

    match book:
        case tuple():
            print('Неверный формат данных')
        case [title, author, pages, _] | [_, title, author, pages, _]:
            print(f'Книга: {title}; Автор: {author}; Количество страниц: {pages}')
        case _:
            print('Другой формат данных')


if __name__ == '__main__':
    # ex1()
    # ex2()
    ex3()
