import pickle

books = [
    ("Лев Толстой", "Война и мир", 1225),
    ("Федор Достоевский", "Преступление и наказание", 430),
    ("Антон Чехов", "Три сестры", 120),
    ("Михаил Булгаков", "Мастер и Маргарита", 400),
    ("Александр Пушкин", "Евгений Онегин", 300),
    ("Джордж Оруэлл", "1984", 328),
    ("Рэй Брэдбери", "451 градус по Фаренгейту", 256),
    ("Габриэль Гарсиа Маркес", "Сто лет одиночества", 417),
    ("Харуки Мураками", "Норвежский лес", 400),
    ("Джейн Остин", "Гордость и предубеждение", 432)
]


file = open("out_bin.txt", "rb")
b_data = pickle.load(file)
print(b_data)
file.close()
